---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectPhase
source: html/dcecd10d-c80c-e1e2-11ba-c0ae57951deb.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectPhase Property

The project phase of the EnergyData information.

## Syntax (C#)
```csharp
public ElementId ProjectPhase { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input element is not a project phase.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null